#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月15日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：在屏幕上打印杨辉三角。
 *******************************************************************************************/
#include<stdio.h>

 //打印函数
 //n最多等于20，不能再多了。
void print(int n)
{
	int arr[20] = { 0 };
	int arr_sr[20] = { 0 };
	int i = 0;
	int j = 0;
	int k = 0;
	int m = 0;
	for (i = 0; i < 20; i++)
	{
		arr[i] = 1;
	}
	for (i = 0; i < 20; i++)
	{
		arr_sr[i] = 1;
	}
	printf("%d \n", 1);
	for (i = 2; i <= n; i++)
	{
		k = 1;//变量复位
		printf("%d  ", 1);
		for (j = 0; j < (i - 2); j++)
		{
			printf("%d  ", arr[j] + arr[j + 1]);
			arr_sr[k] = arr[j] + arr[j + 1];
			k++;
		}
		printf("%d  \n", 1);

		for (m = 0; m < 20; m++)
		{
			arr[m] = arr_sr[m];
		}
	}
}

//主函数
int main()
{
	int n = 0;
	while (EOF != scanf("%d", &n))
	{
		printf("=======================\n");
		print(n);
		printf("\n");
	}
	return 0;
}