#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  月日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：实现一个函数，可以左旋字符串中的k个字符。
 *              例如：ABCD左旋一个字符得到BCDA，ABCD左旋两个字符得到CDAB。
 *******************************************************************************************/
#include<stdio.h>
#include<assert.h>

 //spin_1输入字符串地址，左旋数目；
 //注意字符串长度不得超过100；
 //若左旋数目超出字符串长度，则返回EOF。
int spin_l(char* p_import, int move)
{
	assert(p_import != NULL);//野指针断言
	char* p = p_import;
	int count = 0;
	while (*p != '\0')
	{
		p++;
		count++;
	}
	p = p_import;
	if (move > count)//输入错误提示
	{
		return EOF;
	}
	int i = 0;
	int j = 0;
	char arr_push[100] = { '0' };
	for (i = 0; i < move; i++)//使用第三方数组储存要移动的字符串
	{
		arr_push[i] = *(p + i);
	}
	for (i = 0; i < (count - move); i++)//把剩下的字符串提到前面
	{
		*(p + i) = *(p + move + i);
	}
	for (i = (count - move), j = 0; i < count; i++, j++)//把储存的字符串移到后面
	{
		*(p + i) = arr_push[j];
	}
}

//程序允许多次输入，输入格式为：字符串 回车 左旋数目 回车
int main()
{
	char arr[100] = { '0' };
	while (EOF != scanf("%[^\n]", &arr))
	{
		int shirt = 0;
		int flag = 0;//放置返回值
		scanf("%d", &shirt);
		flag = spin_l(arr, shirt);
		if (flag == EOF)//判断是否输入错误
		{
			break;
		}
		printf("%s\n", arr);
		char c_tmp;
		while ((c_tmp = getchar() != '\n') && c_tmp != EOF);//清除缓冲区
	}
	printf("请检查您的输入是否有误，再重新运行程序");//请勿使用UTF-8汉字编码
	return 0;
}