#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月22日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：将课堂上所讲使用函数指针数组实现转移表的代码，自己实践后，并提交代码到答案窗口。
 *******************************************************************************************/
#include<stdio.h>

int add(int x, int y)
{
	return x + y;
}

int sub(int x, int y)
{
	return x - y;
}

int mul(int x, int y)
{
	return x * y;
}

int idiv(int x, int y)
{
	return x / y;
}

int main()
{
	int (*p[5])(int, int) = { 0, add, sub, mul, idiv };
	int import = 0;
	int x = 0;
	int y = 0;
	int z = 0;
	do
	{
		printf("计算器正在准备中，请稍后\n");
		printf("*****************************************************\n");
		printf("*************      1.加法 2.减法      ****************\n");
		printf("*************      3.乘法 4.除法      ****************\n");
		printf("********************   0.退出    *********************\n");
		printf("请选择：");
		scanf_s("%d", & import);
		if (import >= 1 && import <= 4)
		{
			printf("请输入操作数：\n");
			scanf_s("%d%d", &x, &y);
			z = p[import](x, y);
			printf("操作结果是：%d\n", z);
		}
		else if (import == 0)
		{
			printf("正在退出\n");
		}
		else
		{
			printf("你的输入错误，请重新输入:\n");
		}
	} while (import);
	return 0;
}