#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.1
 * 【完成日期】：	2024年  4月22日
 * 【更新内容】：优化了底层逻辑
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.0
 * 【历史日期】：	2024年  4月22日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：一个数组中只有两个数字是出现一次，其他所有数字都出现了两次。
			   编写一个函数找出这两个只出现一次的数字。
*******************************************************************************************/
//例如：
//有数组的元素是：1，2，3，4，5，1，2，3，4，6
//只有5和6只出现1次，要找出5和6.


#include<stdio.h>

#if 0
V1.0的seek
//寻找函数
void seek(int* p, int sz, int key[2])
{
	int i = 0;
	int j = 0;
	int k = 0;
	int flag = 0;
	for (i = 0; i < sz; i++)
	{
		flag = 0;
		for (j = 0; j < sz; j++)
		{
			if (j == i)
			{
				continue;
			}
			else
			{
				if (*(p + i) == *(p + j))
				{
					flag = 1;
					break;
				}
			}
		}
		if (flag == 0)
		{
			key[k] = *(p + i);
			k++;
			if (k == 2)
			{
				break;
			}
		}
	}
}
#endif

//在单身狗1中我们把所有元素按位异或就可以找到单身那个，
//而在单身狗2中，有两个单身狗，这两个单身狗按位异或后的结果
//可以体现出他两哪一位是不一样的，比如，0x0010 0x0110 &后的结果是0x0100,
//然后就可以依据这个位把元素分成两拨，再分别对这两波&就行了。

void seek(int* pa, int sz, int* key)
{

	int push = 0;
	int push1 = 0;
	int push2 = 0;
	int S = 0;
	int i = 0;
	int j = 0;

	for (i = 0; i < sz; i++)
	{
		push ^= *(pa + i);
	}
	for (j = 1; S != 1; j++)
	{
		S = (push >> (j - 1)) & 0x01;
	}
	j--;
	for (i = 0; i < sz; i++)
	{
		if (((*(pa + i) >> (j - 1)) & 0x01) == 1)
		{
			key[0] ^= *(pa + i);
		}
		else
		{
			key[1] ^= *(pa + i);
		}

	}
}

//主函数
int main()
{
	int key[2] = { 0 };
	int arr[] = { 1, 2, 3, 4, 7, 1, 2, 3, 4, 6 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	seek(arr, sz, key);
	int i = 0;
	printf("它们是单身狗：\n");
	for (i = 0; i < 2; i++)
	{
		printf("%d ", key[i]);
	}
	return 0;
}