#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月16日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：实验函数gets()使用的注意事项
 * 【参考资料】：http://t.csdnimg.cn/7C7d0  (博客有误，取消参考)
 *******************************************************************************************/
#include<stdio.h>
int main()
{
	char str1[20] = { '0' };
	char str2[20] = { '0' };
	char str3[20] = { '0' };
	gets(str1);//abc\n
	gets(str2);//abc\n
	gets(str3);//abc\n
	printf("str1==%s\n", str1);
	printf("str2==%s\n", str2);
	printf("str3==%s\n", str3);
	//输出的结果是：abc\nabc,str2 读到的是回车。

	return 0;
}