#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ===================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月3日
 * ===================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年
 * ===================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】： 求两个整型m和n的二进制表达中，有多少个位不同
 *******************************************************************************************/
#include<stdio.h>
int Cpae(int m, int n)//compare(比较)的缩写
{
	int i = 0;
	int count = 0;//计数
	for (i = 0; i < 32; i++)
	{
		if ((m & (1 << i)) != (n & (1 << i)))
		{
			count++;
		}
	}
	return count++;
}

//测试函数功能
int main()
{
	int x = 0;
	int y = 0;
	int z = 0;//存放返回值
	while (EOF != scanf("%d %d", &x, &y))
	{
		z = Cpae(x, y);
		printf("%d", z);
	}
	return 0;
}