#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：
 * 【文件标识】：
 * ===================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V
 * 【完成日期】：	2024年
 * ===================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V
 * 【历史日期】：	2024年
 * ===================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：定义 赋值 打印 结构体，
 *******************************************************************************************/
#include<stdio.h>
 //实验性质的结构体
struct game
{
	char name1[20];//游戏名
	char name2[20];//游戏名
	char name3[20];//游戏名
	char name[20];//出版公司名
};
int main()
{
	//体会整型提升
	/*char a = 127;
	char b = 3;
	char c = a + b;
	printf("%d\n", a + b);
	printf("%d\n", c);*/

	//赋值打印结构体
	struct game g = { "GenshinImpact","HonkaiImpact3rd","Honkai:StarRail","MiHoYo" };
	printf("%s %s %s %s", g.name1, g.name2, g.name3, g.name);

	return 0;
}