#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  月日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：strstr的模拟实现
 *******************************************************************************************/

#include<stdio.h>
#include<assert.h>
#include<string.h>

char* my_strstr(const char* str1, const char* str2)
{
	assert(str1 && str2);
	if (*str2 == '\0')
	{
		return str1;
	}
	char* s1 = NULL;
	char* s2 = NULL;
	while (*str1)
	{
		s1 = str1;
		s2 = str2;
		while (*str1 == *str2 && *str2 != '\0')
		{
			str1++;
			str2++;
		}
		if (*str1 != *str2 && *str2 != '\0')
		{
			str1 = s1;
			str2 = s2;
			str1++;
		}
		if (*str2 == '\0')
		{
			return s1;
		}

	}
	return NULL;
}

int main()
{
	char* str1 = "hello word";
	char* str2 = "llo w";
	printf("%s\n", my_strstr(str1, str2));
	return 0;
}