#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  月日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：offsetof宏的实现:该宏用于计算结构体中某变量相对于首地址的偏移
 *******************************************************************************************/
#include<stdio.h>

#define MY_offsetof(member, entirety)\
		(int)(((char*)(&(member))) - ((char*)(&(entirety))))

typedef struct test1
{
	char c1;
	int i;
	char c2;
}test1;

int main()
{
	test1 t = { 0 };
	printf("%d\n", MY_offsetof(t.i, t));
	return 0;
}

