#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月9日
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：使用while ((c_tmp = getchar() != '\n') && c_tmp != EOF);清除缓冲区。
 *******************************************************************************************/
#include<stdio.h>
 //代码来源：http://t.csdnimg.cn/0yy3v
int main()
{
	char ch[3];
	printf("请输入字符ch:");//1 2 3 回车
	scanf("%s", &ch);// 读取123
	printf("字符ch的值：%s\n", ch);//输出 字符ch的值：123
	char c_tmp;
	while ((c_tmp = getchar() != '\n') && c_tmp != EOF);
	printf("请输入字符：");// 1 2 3 回车
	printf("%c", getchar());//由于清空了缓存区，第一个getchar()并没有读取123之后的回车，而是读取1
	printf("%c", getchar());//读取并输出2
	printf("%c", getchar());//读取并输出3
	return 0;
}
