#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月15日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：有一个数字矩阵，矩阵中的元素从左到右和从上到下都是递增的，
 *              请编写程序在这样的矩阵中查找某个数字是否存在。
 *******************************************************************************************/
# if 0
比如：
1   3   6  9
4   5   7 10
6   9  12 13
8  11  14 16
#endif 

#include<stdio.h>
#include<assert.h>
//Young_search 基于杨氏矩阵的查找函数，输入首元素地址 行 列 查找目标
//返回0：找不到   返回1：找得到
int Young_search(int(*p)[4], int row, int rank, int aim)
{
	assert(p != NULL);//断言野指针
	int i = 0;
	int j = 0;
	int flag = 0;
	for (i = 0; i < row; i++)
	{
		for (j = 0; j < rank; j++)
		{
			if (aim == p[i][j])
			{
				flag = 1;
			}
		}

	}
	if (flag == 1)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

//主函数
int main()
{
	int push = 0;
	int arr[4][4] = {
								   1, 3, 6, 9,
								   4, 5, 7, 10,
								   6, 9, 12, 13,
								   8, 11, 14, 16
	};
	int nu = 0;
	printf("请输入您所要查找的数字：\n");
	while (EOF != scanf("%d", &nu))
	{
		push = Young_search(arr, 4, 4, nu);
		if (push == 0)
		{
			printf("找不到。\n");
		}
		else
		{
			printf("找到了。\n");
		}
	}
	return 0;
}