#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ========================================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.0
 * 【完成日期】：	2024年  4月10日
 * 【更新内容】：
 * ========================================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.
 * 【历史日期】：	2024年  月日
 * ========================================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：实现递归经典问题汉诺塔（测试性质）
 *******************************************************************************************/
#include<stdio.h>
#include<assert.h>
#include<math.h>

 //逻辑函数
int test_logic(int n)
{
	if (n > 1)
	{
		return 2 * test_logic(n - 1) + 1;
	}
	else if (n == 1)
	{
		return 1;
	}
	else
	{
		return EOF;
	}
}

//公式函数
int test_math(int const* const p_import)//使用const修饰指针变量，防止其和其指向内容遭到非法篡改
{
	assert(p_import != NULL);//野指针断言
	int* p = p_import;
	return pow(2, *p);
}


int main()
{
	return 0;
}