#define _CRT_SECURE_NO_WARNINGS 
/******************************************************************************************
 * 【文件名称】：	main.c
 * 【文件标识】：
 * ===================================================================
 * 【当前作者】：	听风若依
 * 【当前版本】：	V1.1
 * 【完成日期】：	2024年  4月8日
 * ===================================================================
 * 【历史作者】：	听风若依
 * 【历史版本】：	V1.0
 * 【历史日期】：	2024年  4月6日
 * ===================================================================
 * 【开发平台】：	VS2022
 * 【程序内容】：在一个整型数组中，只有一个数字出现一次，
 *              其他数组都是成对出现的，请找出那个只出现一次的数字。
 *******************************************************************************************/
#include<stdio.h>
#if 0
int main()
{
	int arr[] = { 1,2,3,4,5,1,2,3,4 };
	int sz = 0;
	int i, j = 0;
	int flag = 1;
	sz = sizeof(arr) / sizeof(arr[0]);
	for (i = 0; i < sz; i++)
	{
		flag = 1;
		for (j = 0; j < sz; j++)
		{
			if (i == j)
			{
				continue;
			}
			else
			{
				if (arr[i] == arr[j])
				{
					flag = 0;
					break;
				}
			}
		}
		if (flag == 1)
		{
			printf("%d", arr[i]);
			break;
		}
	}

	return 0;
}
#endif
//按位异或是有交换律的，就像1+2+3+4==1+3+4+5，
//1^2^3^4^5^1^2^3^4==(1^1)^(2^2)^(3^3)^(4^4)^3,
// 并且(1^1)^(2^2)^(3^3)^(4^4)^3 = 0^0^0^0^3 = 3。
int main()
{
	int arr[] = { 1,2,3,4,5,1,2,3,4 };
	int sz = sizeof(arr) / sizeof(arr[0]);
	int result = 0;
	int i = 0;
	for (i = 0; i < sz; i++)
	{
		result ^= arr[i];
	}
	printf("%d\n", result);
	return 0;
}